app/Http/Controllers/CategoryController.php

    public function index()
    {
        $categoriesGet = Category::with('categories')
            ->withCount('products')
            ->orderBy('id', 'desc')
            ->paginate(10);
---
select count(*) as aggregate from `categories`

    public function create()
    {
        $parent = Category::all();
---
select * from `categories` where `categories`.`parent_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

    public function edit(Category $id)
    {
        $parent = Category::all();
---
select * from `categories`