app/Http/Controllers/NewsController.php

    public function index()
    {
        $news = News::orderBy('id', 'desc')->with('products:id,name')->paginate(20);
---
select * from `news` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `news`