app/Http/Controllers/ProductController.php

    public function index()
    {
        $products = Product::with('categories')->orderBy('id', 'desc')->paginate(20);
---
select * from `products` order by `id` desc limit 20 offset 0
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` in (986, 987, 988, 989, 990, 991, 992, 993, 994, 995, 996, 997, 998, 999, 1000, 1001, 1002, 1003, 1004, 1005)
select count(*) as aggregate from `products`

    public function create()
    {
        $cate = Category::all();
---
select * from `categories`

    public function store(ProductRequest $request)
    {
        $product = new Product();
        $product->name = $request->name;
        $product->description = $request->description;
        $product->short_description = $request->short_description;
        $product->price = $request->price;
        $product->quantity = $request->quantity;
        $product->status = $request->status;
        $product->category_id = $request->category_id;

        if ($request->hasFile('thumbnail_url')) {
            $file = $request->thumbnail_url;
            $fileHasname = $file->hashName();
            $filename = $request->name . '_' . $fileHasname;
            $product->thumbnail_url = $file->storeAs('images/products', $filename);
        }

        $product->save();
---
insert into `products` (`name`, `description`, `short_description`, `price`, `quantity`, `status`, `category_id`, `thumbnail_url`, `updated_at`, `created_at`) values ('Điện thoại', 'Các dòng điện thoại hãng Samsung', 'adawdasdaw', '123123', '123', '1', '1', '{}', '2022-04-10 16:34:45', '2022-04-10 16:34:45')

    public function edit(Product $pro)
    {
        $cate = Category::all();
---
select * from `categories`